# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 instance segmentation model with RGB DINOv3 backbone and aligned depth CNN bypass.

nc: 80
depth_multiple: 0.50
width_multiple: 0.50
max_channels: 1024

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOBackbone, ["F:/experiment/dinov3-main", "F:/experiment/dinov3-main/weights/dinov3_vits16.pth", "dinov3_vits16", [256, 512, 1024]]] # 0: RGB -> [P3/8, P4/16, P5/32]
  - [-1, 1, BypassCNN, [3, 64]] # 1: depth -> [P2/4, P3/8]
  - [0, 1, Index, [256, 0]] # 2-DINO P3/8
  - [0, 1, Index, [512, 1]] # 3-DINO P4/16
  - [0, 1, Index, [1024, 2]] # 4-DINO P5/32
  - [1, 1, Index, [128, 0]] # 5-depth P2/4
  - [1, 1, Index, [256, 1]] # 6-depth P3/8
  - [5, 1, Conv, [256, 3, 2]] # 7-depth P2 -> P3
  - [[2, 6, 7], 1, Concat, [1]] # 8-fuse DINO P3 + depth P3
  - [-1, 2, C3k2, [256, False]] # 9-fused P3/8

head:
  - [4, 1, SPPF, [1024, 5]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat DINO P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat fused P3
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
