# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 instance segmentation model with a project-local DINOv3 ConvNeXt-Base backbone
# and a registered BiFPN neck.

nc: 80
depth_multiple: 0.50
width_multiple: 0.50
max_channels: 1024

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOBackbone, ["weights/dinov3_convnext_base", "weights/dinov3_convnext_base/dinov3_convnext_base.safetensors", "dinov3_convnext_base", [128, 256, 512, 1024]]] # 0: [P2/4, P3/8, P4/16, P5/32]
  - [0, 1, Index, [128, 0]] # 1-P2/4
  - [0, 1, Index, [256, 1]] # 2-P3/8
  - [0, 1, Index, [512, 2]] # 3-P4/16
  - [0, 1, Index, [1024, 3]] # 4-P5/32

head:
  # BiFPN(P2, P3, P4, P5) -> [P2_out, P3_out, P4_out, P5_out]
  - [[1, 2, 3, 4], 1, BiFPN, [[128, 256, 512, 1024]]] # 5
  - [5, 1, Index, [128, 0]] # 6-P2/4
  - [5, 1, Index, [256, 1]] # 7-P3/8
  - [5, 1, Index, [512, 2]] # 8-P4/16
  - [5, 1, Index, [1024, 3]] # 9-P5/32

  - [[6, 7, 8, 9], 1, Segment, [nc, 32, 256]] # Segment(P2, P3, P4, P5)
