# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 instance segmentation model with a RGB-only DINOv3 ConvNeXt-Base backbone,
# an aligned depth-image CNN bypass, and P2/P3/P4/P5 segmentation heads.

nc: 80
depth_multiple: 0.50
width_multiple: 0.50
max_channels: 1024

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOBackbone, ["weights/dinov3_convnext_base", "weights/dinov3_convnext_base/dinov3_convnext_base.safetensors", "dinov3_convnext_base", [128, 256, 512, 1024]]] # 0: RGB -> [P2/4, P3/8, P4/16, P5/32]
  - [-1, 1, BypassCNN, [3, 64]] # 1: depth -> [P2/4, P3/8]
  - [0, 1, Index, [128, 0]] # 2-DINO P2/4
  - [0, 1, Index, [256, 1]] # 3-DINO P3/8
  - [0, 1, Index, [512, 2]] # 4-DINO P4/16
  - [0, 1, Index, [1024, 3]] # 5-DINO P5/32
  - [1, 1, Index, [128, 0]] # 6-depth P2/4
  - [1, 1, Index, [256, 1]] # 7-depth P3/8
  - [[2, 6], 1, Concat, [1]] # 8-fuse DINO P2 + depth P2
  - [-1, 2, C3k2, [128, False]] # 9-fused P2/4
  - [[3, 7], 1, Concat, [1]] # 10-fuse DINO P3 + depth P3
  - [-1, 2, C3k2, [256, False]] # 11-fused P3/8

head:
  - [5, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat DINO P4
  - [-1, 2, C3k2, [512, False]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Concat, [1]] # cat fused P3
  - [-1, 2, C3k2, [256, False]] # 19 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat fused P2
  - [-1, 2, C3k2, [128, False]] # 22 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 25 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 28 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 31 (P5/32-large)

  - [[22, 25, 28, 31], 1, Segment, [nc, 32, 256]] # Segment(P2, P3, P4, P5)
