# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 instance segmentation model with a project-local DINOv3 ConvNeXt-Base backbone.

nc: 80
depth_multiple: 0.50
width_multiple: 0.50
max_channels: 1024

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOBackbone, ["weights/dinov3_convnext_base", "weights/dinov3_convnext_base/dinov3_convnext_base.safetensors", "dinov3_convnext_base", [128, 256, 512, 1024]]] # 0: [P2/4, P3/8, P4/16, P5/32]
  - [0, 1, Index, [128, 0]] # 1-P2/4
  - [0, 1, Index, [256, 1]] # 2-P3/8
  - [0, 1, Index, [512, 2]] # 3-P4/16
  - [0, 1, Index, [1024, 3]] # 4-P5/32

head:
  - [4, 1, SPPF, [1024, 5]] # 5
  - [-1, 2, C2PSA, [1024]] # 6

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat DINO P4
  - [-1, 2, C3k2, [512, False]] # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat DINO P3
  - [-1, 2, C3k2, [256, False]] # 12 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat DINO P2
  - [-1, 2, C3k2, [128, False]] # 15 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 6], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[15, 18, 21, 24], 1, Segment, [nc, 32, 256]] # Segment(P2, P3, P4, P5)
