# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 detection model with a project-local DINOv3 ConvNeXt-Base backbone.

nc: 80
depth_multiple: 0.50
width_multiple: 0.50
max_channels: 1024

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOBackbone, ["weights/dinov3_convnext_base", "weights/dinov3_convnext_base/dinov3_convnext_base.safetensors", "dinov3_convnext_base", [256, 512, 1024]]] # 0: [P3/8, P4/16, P5/32]
  - [0, 1, Index, [256, 0]] # 1-P3/8
  - [0, 1, Index, [512, 1]] # 2-P4/16
  - [0, 1, Index, [1024, 2]] # 3-P5/32

head:
  - [3, 1, SPPF, [1024, 5]] # 4
  - [-1, 2, C2PSA, [1024]] # 5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat DINO P4
  - [-1, 2, C3k2, [512, False]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat DINO P3
  - [-1, 2, C3k2, [256, False]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]] # Detect(P3, P4, P5)
